/**
 * 0 幸运值
 * 1 初始怒气
 * 2 技能冷却速度
 * 3 飞索距离
 * 4 飞索速度
 * 5 每秒怒气回复
 * 6 每秒精力回复
 * 7 精力上限
 * 8 闪避精力消耗
 * 9 伤害怒气转换
 * 10 受伤怒气转换
 * 11 魂冢能量损失速度
 * 12 受到暗域伤害降低
 * 13 货郎折扣
 * 14 每10秒获得暗潮币
 * 15 救援速度
 * 16 敌方血条存在时间
 */
var params = {
    skill: {
        yj4: [
            {
                name:'万物·狐商',
                class: '',
                img: 'naraka/yj/4/yj4_1.png',
                type:'万物',
                effect:'货郎折扣+4.0%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4.0, 0, 0, 0],
            },{
                name:'万物·犬怒',
                class: '',
                img: 'naraka/yj/4/yj4_2.png',
                type:'万物',
                effect:'初始怒气+6.7%',
                data:[0, 6.7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            },{
                name:'万物·鼠行',
                class: '',
                img: 'naraka/yj/4/yj4_3.png',
                type:'万物',
                effect:'货郎折扣+2.0%\n每10秒获得暗潮币+5',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2.0, 5, 0, 0],
            },{
                name:'万物·水润',
                class: '',
                img: 'naraka/yj/4/yj4_4.png',
                type:'万物',
                effect:'救援速度+7.5%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7.5, 0],
            },{
                name:'万物·顽石',
                class: '',
                img: 'naraka/yj/4/yj4_5.png',
                type:'万物',
                effect:'精力上限+5.0%',
                data:[0, 0, 0, 0, 0, 0, 0, 5.0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            },
        ],
        yj3: [
            {
                name:'极阴·暴怒',
                class: '',
                img: 'naraka/yj/3/yj3_1.png',
                type:'极阴',
                effect:'伤害转换怒气+7.5%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 7.5, 0, 0, 0, 0, 0, 0, 0],
            },{
                name:'极阴·洞悉',
                class: '',
                img: 'naraka/yj/3/yj3_2.png',
                type:'极阴',
                effect:'敌方血条存在时间+15.0%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15.0],
            },{
                name:'极阴·反噬',
                class: '',
                img: 'naraka/yj/3/yj3_3.png',
                type:'极阴',
                effect:'受伤怒气转换+7.5%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7.5, 0, 0, 0, 0, 0, 0],
            },{
                name:'极阴·灵巧',
                class: '',
                img: 'naraka/yj/3/yj3_4.png',
                type:'极阴',
                effect:'闪避精力消耗-2.0%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 2.0, 0, 0, 0, 0, 0, 0, 0, 0],
            },{
                name:'极阴·魔索',
                class: '',
                img: 'naraka/yj/3/yj3_5.png',
                type:'极阴',
                effect:'飞索速度+1.7%',
                data:[0, 0, 0, 0, 1.7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            },
        ],
        yj2: [
            {
                name:'极阳·急速',
                class: '',
                img: 'naraka/yj/2/yj2_1.png',
                type:'极阳',
                effect:'技能冷却速度+3.0%',
                data:[0, 0, 3.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            }, {
                name:'极阳·耐阴',
                class: '',
                img: 'naraka/yj/2/yj2_2.png',
                type:'极阳',
                effect:'受到暗域伤害降低+2.5%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2.5, 0, 0, 0, 0],
            }, {
                name:'极阳·奇迹',
                class: '',
                img: 'naraka/yj/2/yj2_3.png',
                type:'极阳',
                effect:'幸运值+200',
                data:[200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            }, {
                name:'极阳·神索',
                class: '',
                img: 'naraka/yj/2/yj2_4.png',
                type:'极阳',
                effect:'飞索距离+5.0%',
                data:[0, 0, 0, 5.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            }, {
                name:'极阳·天选',
                class: '',
                img: 'naraka/yj/2/yj2_5.png',
                type:'极阳',
                effect:'幸运值+100\n货郎折扣+2.0%',
                data:[100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2.0, 0, 0, 0],
            },
        ],
        yj1: [
            {
                name:'本源·生财',
                class: '',
                img: 'naraka/yj/1/yj1_1.png',
                type:'本源',
                effect:'每10秒获得暗潮币+10',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0],
            },{
                name:'本源·气运',
                class: '',
                img: 'naraka/yj/1/yj1_2.png',
                type:'本源',
                effect:'每10秒获得暗潮币+5\n幸运值+100',
                data:[100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0],
            },{
                name:'本源·坚韧',
                class: '',
                img: 'naraka/yj/1/yj1_3.png',
                type:'本源',
                effect:'魂冢能量损失速度-5.0%',
                data:[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5.0, 0, 0, 0, 0, 0],
            },{
                name:'本源·体能',
                class: '',
                img: 'naraka/yj/1/yj1_4.png',
                type:'本源',
                effect:'每秒精力回复+2.5%',
                data:[0, 0, 0, 0, 0, 0, 2.5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            },{
                name:'本源·易怒',
                class: '',
                img: 'naraka/yj/1/yj1_5.png',
                type:'本源',
                effect:'每秒怒气回复+6.67%',
                data:[0, 0, 0, 0, 0, 6.67, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            },
        ],

    }
}

export {params}
